ItaySharon/cmsis-svd/data/Fujitsu/MB9AF1AxM.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x34</addressOffset>
        <description>PLL Clock Stabilization Wait Time Setup Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>PLL input clock select bit </description>
            <name>PINC</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>PLL clock stabilization wait time setup bit </description>
            <name>POWT</name>
          </field>
        </fields>
        <name>PSW_TMR</name>
        <resetMask>0x17</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x38</addressOffset>
        <description>PLL Control Register 1</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>PLL input clock frequency division ratio setting bit </description>
            <name>PLLK</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>PLL VCO clock frequency division ratio setting bit </description>
            <name>PLLM</name>
          </field>
        </fields>
        <name>PLL_CTL1</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x3C</addressOffset>
        <description>PLL Control Register 2</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x6</bitWidth>
            <description>PLL feedback frequency division ratio setting bit </description>
            <name>PLLN</name>
          </field>
        </fields>
        <name>PLL_CTL2</name>
        <resetMask>0x3F</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x54</addressOffset>
        <description>Debug Break Watchdog Timer Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>HW-WDG debug mode break bit </description>
            <name>DPHWBE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>SW-WDG debug mode break bit </description>
            <name>DPSWBE</name>
          </field>
        </fields>
        <name>DBWDT_CTL</name>
        <resetMask>0xA0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x60</addressOffset>
        <description> Interrupt Enable Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Anomalous frequency detection interrupt enable bit </description>
            <name>FCSE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>PLL oscillation stabilization completion interrupt enable bit </description>
            <name>PCSE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Sub oscillation stabilization completion interrupt enable bit </description>
            <name>SCSE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Main oscillation stabilization completion interrupt enable bit</description>
            <name>MCSE</name>
          </field>
        </fields>
        <name>INT_ENR</name>
        <resetMask>0x27</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x64</addressOffset>
        <description>Interrupt Status Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Anomalous frequency detection interrupt status bit </description>
            <name>FCSI</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>PLL oscillation stabilization completion interrupt status bit </description>
            <name>PCSI</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Sub oscillation stabilization completion interrupt status bit</description>
            <name>SCSI</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Main oscillation stabilization completion interrupt status bit </description>
            <name>MCSI</name>
          </field>
        </fields>
        <name>INT_STR</name>
        <resetMask>0x27</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
