ItaySharon/cmsis-svd/data/Fujitsu/MB9AF1AxM.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC</addressOffset>
        <description>Software Watchdog Timer Clear Register</description>
        <fields></fields>
        <name>WDOGINTCLR</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0xFFFFFFFF</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x10</addressOffset>
        <description>Software Watchdog Timer Interrupt Status Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Software watchdog interrupt status bit</description>
            <name>RIS</name>
          </field>
        </fields>
        <name>WDOGRIS</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC00</addressOffset>
        <description>Software Watchdog Timer Lock Register</description>
        <fields></fields>
        <name>WDOGLOCK</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <resetMask>0x0</resetMask>
    <resetValue>0x0</resetValue>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <access>read-write</access>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x4</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40011000</baseAddress>
    <description>Hardware Watchdog Timer</description>
    <groupName>HWWDT</groupName>
    <interrupts></interrupts>
    <name>HWWDT</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <description>Hardware Watchdog Timer Load Register</description>
        <fields></fields>
        <name>WDG_LDR</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0xFFFF</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x4</addressOffset>
        <description>Hardware Watchdog Timer Value Register</description>
        <fields></fields>
        <name>WDG_VLR</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x8</addressOffset>
        <description>Hardware Watchdog Timer Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Hardware watchdog reset enable bit</description>
            <name>RESEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Hardware watchdog interrupt and counter enable bit </description>
            <name>INTEN</name>
          </field>
        </fields>
        <name>WDG_CTL</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x3</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC</addressOffset>
        <description>Hardware Watchdog Timer Clear Register</description>
        <fields></fields>
        <name>WDG_ICL</name>
        <resetMask>0x0</resetMask>
        <resetValue>0xFF</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x10</addressOffset>
        <description>Hardware Watchdog Timer Interrupt Status Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Hardware watchdog interrupt status bit</description>
            <name>RIS</name>
          </field>
        </fields>
        <name>WDG_RIS</name>
        <resetMask>0x0</resetMask>
        <resetValue>0xFF</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC00</addressOffset>
        <description>Hardware Watchdog Timer Lock Register</description>
        <fields></fields>
        <name>WDG_LCK</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x1</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <resetMask>0x0</resetMask>
    <resetValue>0x0</resetValue>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <access>read-write</access>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x2</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40020000</baseAddress>
    <description>Multifunction Timer 0</description>
    <groupName>MFT0</groupName>
    <interrupts>
      <interrupt>
        <name>WFG</name>
        <value>0x3</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>FRTIM</name>
        <value>0x19</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>INCAP</name>
        <value>0x1A</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>OUTCOMP</name>
        <value>0x1B</value>
      </interrupt>
    </interrupts>
    <name>MFT0</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x30</addressOffset>
        <description>FRT-ch.0 Control Register A</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>FRT clock cycle</description>
            <name>CLK</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>write-only</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>FRT operation state initialization request</description>
            <name>SCLR</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>FRT's count mode</description>
            <name>MODE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Puts FRT in stopping state</description>
            <name>STOP</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Enables TCCP's buffer function</description>
            <name>BFE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>"Generates interrupt when ""1"" is set to TCSA.ICLR"</description>
            <name>ICRE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x9</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>interrupt flag</description>
            <name>ICLR</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xD</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>"Generates interrupt, when ""1"" is set to TCSA.IRQZF"</description>
            <name>IRQZE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xE</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>zero interrupt flag</description>
            <name>IRQZF</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xF</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Uses an external input clock (FRCK) as FRT's count clock</description>
            <name>ECKE</name>
          </field>
        </fields>
        <name>FRT_TCSA0</name>
        <resetMask>0xE3FF</resetMask>
        <resetValue>0x40</resetValue>
        <size>0x10</size>
      </register>
