ItaySharon/cmsis-svd/data/Fujitsu/MB9AF1AxM.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x40</addressOffset>
        <description>FRT-ch.1 Control Register A</description>
        <fields></fields>
        <name>FRT_TCSA1</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x50</addressOffset>
        <description>FRT-ch.2 Control Register A</description>
        <fields></fields>
        <name>FRT_TCSA2</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x34</addressOffset>
        <description>FRT-ch.0 Control Register B</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Outputs AD conversion start signal to ADCunit2 upon Zero value detection by FRT</description>
            <name>AD2E</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Outputs AD conversion start signal to ADCunit1 upon Zero value detection by FRT</description>
            <name>AD1E</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Outputs AD conversion start signal to ADCunit0 upon Zero value detection by FRT</description>
            <name>AD0E</name>
          </field>
        </fields>
        <name>FRT_TCSB0</name>
        <resetMask>0x7</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x44</addressOffset>
        <description>FRT-ch.1 Control Register B</description>
        <fields></fields>
        <name>FRT_TCSB1</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x54</addressOffset>
        <description>FRT-ch.2 Control Register B</description>
        <fields></fields>
        <name>FRT_TCSB2</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x28</addressOffset>
        <description>FRT-ch.0 Cycle Setting Register</description>
        <fields></fields>
        <name>FRT_TCCP0</name>
        <resetMask>0xFFFF</resetMask>
        <resetValue>0xFFFF</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x38</addressOffset>
        <description>FRT-ch.1 Cycle Setting Register</description>
        <fields></fields>
        <name>FRT_TCCP1</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x48</addressOffset>
        <description>FRT-ch.2 Cycle Setting Register</description>
        <fields></fields>
        <name>FRT_TCCP2</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x2C</addressOffset>
        <description>FRT-ch.0 Count Value Register</description>
        <fields></fields>
        <name>FRT_TCDT0</name>
        <resetMask>0xFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x3C</addressOffset>
        <description>FRT-ch.1 Count Value Register</description>
        <fields></fields>
        <name>FRT_TCDT1</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4C</addressOffset>
        <description>FRT-ch.2 Count Value Register</description>
        <fields></fields>
        <name>FRT_TCDT2</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x58</addressOffset>
        <description>"OCU ch.1,0 Connecting FRT Select Register"</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>Connects FRT ch.x to OCU ch.0</description>
            <name>FSO0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>Connects FRT ch.x to OCU ch.1</description>
            <name>FSO1</name>
          </field>
        </fields>
        <name>OCU_OCFS10</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x59</addressOffset>
        <description>"OCU ch.3,2 Connecting FRT Select Register"</description>
        <fields></fields>
        <name>OCU_OCFS32</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
