ItaySharon/cmsis-svd/data/Fujitsu/MB9AF1AxM.svd
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x14</addressOffset>
        <description>Non Maskable Interrupt Request Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>NMI interrupt request detection bit </description>
            <name>NR</name>
          </field>
        </fields>
        <name>NMIRR</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x18</addressOffset>
        <description>Non Maskable Interrupt Clear Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>NMI interrupt cause clear bit</description>
            <name>NCL</name>
          </field>
        </fields>
        <name>NMICL</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x1</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <resetMask>0x0</resetMask>
    <resetValue>0x0</resetValue>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <access>read-write</access>
    <addressBlock>
      <offset>0x10</offset>
      <size>0x94</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40031000</baseAddress>
    <description>Interrupts</description>
    <groupName>INTREQ</groupName>
    <interrupts></interrupts>
    <name>INTREQ</name>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x10</addressOffset>
        <description>EXC02 batch read register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Hardware watchdog timer interrupt request</description>
            <name>HWINT</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>External NMIX pin interrupt request </description>
            <name>NMI</name>
          </field>
        </fields>
        <name>EXC02MON</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x14</addressOffset>
        <description>IRQ00 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Anomalous frequency detection by CSV interrupt request </description>
            <name>FCSINT</name>
          </field>
        </fields>
        <name>IRQ00MON</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x18</addressOffset>
        <description>IRQ01 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Software watchdog timer interrupt request </description>
            <name>SWWDTINT</name>
          </field>
        </fields>
        <name>IRQ01MON</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x1C</addressOffset>
        <description>IRQ02 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Low voltage detection (LVD) interrupt request </description>
            <name>LVDINT</name>
          </field>
        </fields>
        <name>IRQ02MON</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x20</addressOffset>
        <description>IRQ03 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>WFG timer 54 interrupt request in MFT unit 0 </description>
            <name>WAVE0INT3</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>WFG timer 32 interrupt request in MFT unit 0 </description>
            <name>WAVE0INT2</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>WFG timer 10 interrupt request in MFT unit 0 </description>
            <name>WAVE0INT1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>DTIF (motor emergency stop) interrupt request in MFT unit 0 </description>
            <name>WAVE0INT0</name>
          </field>
        </fields>
        <name>IRQ03MON</name>
        <resetMask>0xF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
