ItaySharon/cmsis-svd/data/Fujitsu/MB9AF1AxM.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x84</addressOffset>
        <description>IRQ28 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0xF</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRQ1 interrupt request on the base timer ch.7</description>
            <name>BTINT15</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0xE</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRQ0 interrupt request on the base timer ch.7</description>
            <name>BTINT14</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0xD</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRQ1 interrupt request on the base timer ch.6</description>
            <name>BTINT13</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0xC</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRQ0 interrupt request on the base timer ch.6</description>
            <name>BTINT12</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0xB</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRQ1 interrupt request on the base timer ch.5</description>
            <name>BTINT11</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0xA</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRQ0 interrupt request on the base timer ch.5</description>
            <name>BTINT10</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x9</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRQ1 interrupt request on the base timer ch.4</description>
            <name>BTINT9</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRQ0 interrupt request on the base timer ch.4</description>
            <name>BTINT8</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRQ1 interrupt request on the base timer ch.3</description>
            <name>BTINT7</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRQ0 interrupt request on the base timer ch.3</description>
            <name>BTINT6</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRQ1 interrupt request on the base timer ch.2</description>
            <name>BTINT5</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRQ0 interrupt request on the base timer ch.2</description>
            <name>BTINT4</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRQ1 interrupt request on the base timer ch.1</description>
            <name>BTINT3</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRQ0 interrupt request on the base timer ch.1</description>
            <name>BTINT2</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRQ1 interrupt request on the base timer ch.0</description>
            <name>BTINT1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRQ0 interrupt request on the base timer ch.0</description>
            <name>BTINT0</name>
          </field>
        </fields>
        <name>IRQ28MON</name>
        <resetMask>0xFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x8C</addressOffset>
        <description>IRQ30 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt request for HDMI-CEC/Remote Control Reception ch.0</description>
            <name>RCEC0INT</name>
          </field>
        </fields>
        <name>IRQ30MON</name>
        <resetMask>0x20</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x90</addressOffset>
        <description>IRQ31 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt request for HDMI-CEC/Remote Control Reception ch.1</description>
            <name>RCEC1INT</name>
          </field>
        </fields>
        <name>IRQ31MON</name>
        <resetMask>0x40</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
