ItaySharon/cmsis-svd/data/Fujitsu/MB9AF1AxM.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x5C</addressOffset>
        <description>Repeat Code "H" Width Setting Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>"Repeat code "H" width setting bits"</description>
            <name>RCRHW</name>
          </field>
        </fields>
        <name>RCRHW</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x5D</addressOffset>
        <description>Repeat Code Interrupt Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Repeat Code Interrupt enable bit </description>
            <name>RCIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Repeat code detection flag bit</description>
            <name>RC</name>
          </field>
        </fields>
        <name>RCRC</name>
        <resetMask>0x11</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x61</addressOffset>
        <description>Data Bit Width Violation Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Maximum data bit width violation interrupt enable bit</description>
            <name>LELIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Minimum data bit width violation interrupt enable bit</description>
            <name>LESIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Maximum data bit width violation detection enable bit </description>
            <name>LELE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Minimum data bit width violation detection enable bit </description>
            <name>LESE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Error pulse output enable bit</description>
            <name>EPE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Maximum data bit width violation detection flag bit</description>
            <name>LEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Minimum data bit width violation detection flag bit</description>
            <name>LES</name>
          </field>
        </fields>
        <name>RCLE</name>
        <resetMask>0xFB</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x64</addressOffset>
        <description>Minimum Data Bit Width Setting Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Minimum data bit width setting bits</description>
            <name>RCLESW</name>
          </field>
        </fields>
        <name>RCLESW</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x65</addressOffset>
        <description>Maximum Data Bit Width Setting Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Maximum data bit width setting bits</description>
            <name>RCLELW</name>
          </field>
        </fields>
        <name>RCLELW</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <resetMask>0x0</resetMask>
    <resetValue>0x0</resetValue>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <access>read-write</access>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x2</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40035000</baseAddress>
    <description>Low-voltage Detection</description>
    <groupName>LVD</groupName>
    <interrupts>
      <interrupt>
        <name>LVD</name>
        <value>0x2</value>
      </interrupt>
    </interrupts>
    <name>LVD</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <description>Low-voltage Detection Voltage Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xF</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Low-voltage detection reset operation enable bit</description>
            <name>LVDRE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xA</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>Low-voltage detection reset voltage setting bits</description>
            <name>SVHR</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Low-voltage detection interrupt enable bit</description>
            <name>LVDIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>Low-voltage detection interrupt voltage setting bits</description>
            <name>SVHI</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Low-voltage detection interrupt low power mode select bit</description>
            <name>LVDIM</name>
          </field>
        </fields>
        <name>LVD_CTL</name>
        <resetMask>0xBCBE</resetMask>
        <resetValue>0x8400</resetValue>
        <size>0x10</size>
      </register>
