ItaySharon/cmsis-svd/data/Fujitsu/MB9AF1AxM.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x807</addressOffset>
        <description>Backup Registers from 8</description>
        <fields></fields>
        <name>BUR08</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x808</addressOffset>
        <description>Backup Registers from 9</description>
        <fields></fields>
        <name>BUR09</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x809</addressOffset>
        <description>Backup Registers from 10</description>
        <fields></fields>
        <name>BUR10</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x80A</addressOffset>
        <description>Backup Registers from 11</description>
        <fields></fields>
        <name>BUR11</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x80B</addressOffset>
        <description>Backup Registers from 12</description>
        <fields></fields>
        <name>BUR12</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x80C</addressOffset>
        <description>Backup Registers from 13</description>
        <fields></fields>
        <name>BUR13</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x80D</addressOffset>
        <description>Backup Registers from 14</description>
        <fields></fields>
        <name>BUR14</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x80E</addressOffset>
        <description>Backup Registers from 15</description>
        <fields></fields>
        <name>BUR15</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x80F</addressOffset>
        <description>Backup Registers from 16</description>
        <fields></fields>
        <name>BUR16</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <resetMask>0x0</resetMask>
    <resetValue>0x0</resetValue>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <access>read-write</access>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x2</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40038000</baseAddress>
    <description>Multi-function Serial Interface 0</description>
    <groupName>MFS0</groupName>
    <interrupts>
      <interrupt>
        <name>MFS0RX</name>
        <value>0x6</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>MFS0TX</name>
        <value>0x7</value>
      </interrupt>
    </interrupts>
    <name>MFS0</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x1</addressOffset>
        <alternateGroup>UART</alternateGroup>
        <description>Serial Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Programmable Clear bit</description>
            <name>UPCL</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Received interrupt enable bit </description>
            <name>RIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmit interrupt enable bit </description>
            <name>TIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmit bus idle interrupt enable bit </description>
            <name>TBIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Received operation enable bit </description>
            <name>RXE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmission operation enable bit </description>
            <name>TXE</name>
          </field>
        </fields>
        <name>UART_SCR</name>
        <resetMask>0x9F</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
