ItaySharon/cmsis-svd/data/Fujitsu/MB9AF1AxM.svd
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x8</addressOffset>
        <alternateGroup>I2C</alternateGroup>
        <description>Received Data Register</description>
        <fields></fields>
        <name>I2C_RDR</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>write-only</access>
        <addressOffset>0x8</addressOffset>
        <alternateGroup>I2C</alternateGroup>
        <description>Transmit Data Register</description>
        <fields></fields>
        <name>I2C_TDR</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0xFF</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x11</addressOffset>
        <alternateGroup>I2C</alternateGroup>
        <description>7-bit Slave Address Mask Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>I2C interface operation enable bit</description>
            <name>EN</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x7</bitWidth>
            <description>Slave address mask bits</description>
            <name>SM</name>
          </field>
        </fields>
        <name>I2C_ISMK</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x7F</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x10</addressOffset>
        <alternateGroup>I2C</alternateGroup>
        <description>7-bit Slave Address Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Slave address enable bit</description>
            <name>SAEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x7</bitWidth>
            <description>7-bit slave address</description>
            <name>SA</name>
          </field>
        </fields>
        <name>I2C_ISBA</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC</addressOffset>
        <alternateGroup>I2C</alternateGroup>
        <description>Baud Rate Generator Registers</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x7</bitWidth>
            <description>Baud Rate Generator Registers 1</description>
            <name>BGR1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Baud Rate Generator Registers 0</description>
            <name>BGR0</name>
          </field>
        </fields>
        <name>I2C_BGR</name>
        <resetMask>0x7FFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x1D</addressOffset>
        <alternateGroup>I2C</alternateGroup>
        <description>Extension I2C Bus Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>SDA status bit</description>
            <name>SDAS</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>SCL status bit</description>
            <name>SCLS</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>SDA output control bit</description>
            <name>SDAC</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>SCL output control bit</description>
            <name>SCLC</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Serial output enabled bit</description>
            <name>SOCE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bus error control bit</description>
            <name>BEC</name>
          </field>
        </fields>
        <name>I2C_EIBCR</name>
        <resetMask>0x3F</resetMask>
        <resetValue>0xC</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <resetMask>0x0</resetMask>
    <resetValue>0x0</resetValue>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <access>read-write</access>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x2</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40038300</baseAddress>
    <derivedFrom>MFS0</derivedFrom>
    <description>Multi-function Serial Interface 0</description>
    <groupName>MFS0</groupName>
    <interrupts>
      <interrupt>
        <name>MFS3RX</name>
        <value>0xC</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>MFS3TX</name>
        <value>0xD</value>
      </interrupt>
    </interrupts>
    <name>MFS3</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x1</addressOffset>
        <alternateGroup>UART</alternateGroup>
        <description>Serial Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Programmable Clear bit</description>
            <name>UPCL</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Received interrupt enable bit </description>
            <name>RIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmit interrupt enable bit </description>
            <name>TIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmit bus idle interrupt enable bit </description>
            <name>TBIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Received operation enable bit </description>
            <name>RXE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmission operation enable bit </description>
            <name>TXE</name>
          </field>
        </fields>
        <name>UART_SCR</name>
        <resetMask>0x9F</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
